[
  {
    "page_name": "DMBI",
    "text": "<h1>DMBI</h1>\n    <hr>\n\n    <p>\n        The Annual DM for BI conference, organized by the Department of Software and Information Systems Engineering ​at\n        Ben-Gurion University of the Negev, aims at bringing together researchers and practitioners in data mining, data science, machine learning,\n        predictive analytics and related fields to discuss emerging trends and key issues in utilization of data mining methods for business intelligence.  \n    </p>\n\n    <p>\n        The Annual DM for BI conference, organized by the Department of Software and Information Systems Engineering ​at Ben-Gurion University of the Negev,\n        aims at bringing together researchers and practitioners in data mining, data science, machine learning, predictive analytics and related fields to discuss\n        emerging trends and key issues in utilization of data mining methods for business intelligence.  \n    </p>\n    <p>\n        The fourth annual conference was held on May 19th. You can find more its contents and photos\n        <a href=\"http://in.bgu.ac.il/en/engn/ise/dmbi2016/Pages/default.aspx\" target=\"_blank\">here </a>\n\n    </p>",
    "path": "dmbi"
  },
  {
  "page_name": "Teaching",
  "text": "<h1>Teaching</h1>\n    <hr>\n    <h3 class=\"text-center\">\n        M.Sc. in Information Systems Engineering with Specialization in Data Mining and Business Intelligence\n    </h3>\n    <p>\n        <strong>Program of Study</strong><br>\n        The studies towards MSc Degree in Information Systems Engineering with Focus on\n        Data Mining and Business Intelligence comprise 36 credits including eight mandatory and\n        elective courses of 3.0 – 4.0 each and Master Thesis (12 credits).\n    </p>\n    <p>\n        <strong>Supplementary Courses without credit</strong><br>\n        A student admitted to the program, specifically without a degree in Information Systems\n        Engineering, Software Engineering, Computer Science, or Industrial Engineering, may be required to\n        take supplementary courses until the end of the second semester. One can take supplementary courses from the\n        courses offered by Ben-Gurion University or equivalent courses from other accredited universities subject to\n        recommendation by the departmental teaching committee and approval by the Faculty teaching committee.\n\n    </p>\n    <p>\n        <strong>Mandatory Courses</strong>\n        Statistical Methods in Information Systems (3.5 credits) for students without advanced background in statistics only\n        Research Methods in Information Systems (3 credits)<br>\n        Core courses – 12 credits – one should choose four courses out of the following five courses:<br>\n        Advanced Methods in Data Mining and Data Warehousing (3 credits)<br>\n        Text Mining and Web Content Mining (3 credits)<br>\n        Applications of Learning Algorithms in Information Systems (3 credits)<br>\n        Mining Massive Datasets (3 credits) <br>\n        Advanced Information Retrieval Systems (3 credits)\n    </p>\n    <p>\n        The student should take elective courses out of the graduate courses offered by the department\n        to complete 24 credits from the following list of courses:</p>\n        <ul class=\"teaching\">\n\n    <li>\n        Mining financial data\n    </li>\n    <li>\n        Advanced data bases\n    </li>\n    <li>\n        Decision support systemsata\n    </li>\n    <li>\n        Data acquisition and representation\n    </li>\n    <li>\n        Knowledge based systems\n    </li>\n    <li>\n        Search methods in AI\n    </li>\n    <li>\n        Intelligent systems\n    </li>\n    <li>\n         Complex Networks\n    </li>\n    <li>\n         Planning and automatic decision\n    </li>\n    <li>\n        Advanced AI\n    </li>\n    <li>\n        Machine learning methods for attack detection\n    </li>\n    <li>\n        Diagnosis in multi-agent systems\n    </li>\n    <li>\n        Decision support systems for medicine\n    </li>\n    <li>\n        System security engineering\n    </li>\n    <li>\n        Network security\n    </li>\n\n</ul>\n  <p>  The lists of supplementary, mandatory and elective courses are subject to change.\n    </p>\n\n    <p>\n        <strong>Thesis</strong><br>\n        Every graduate student has to do a research thesis under the supervision of a department member. The research proposal is subject to approval by the supervisor and the graduate teaching committee. The thesis is evaluated by the rules of the Faculty of Engineering Sciences. The thesis will be in the area of Data Mining or Business Intelligence.\n         </p>\n    <p>\n        <strong>Who should apply?</strong><br>\n        BSc graduates of Information Systems Engineering, Software Engineering, Computer Science, Industrial Engineering, and similar disciplines from accredited universities. Students without a degree in Information Systems Engineering, Software Engineering, Computer Science, or Industrial Engineering, may be required to take supplementary courses at the discretion of the graduate teaching committee.\n\n    </p>",
  "path": "teaching"
}
]
